simulacoes/bump/rhoCentralFoam/linear/sim3/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   0.333333333333333;
//L 1;

vertices
(
    (0 0 0)      //ponto 0
    (1 0 0)      //ponto 1
    (2 0 0)      //ponto 2
    (3 0 0)      //ponto 3
    (3 1 0)      //ponto 4
    (2 1 0)      //ponto 5
    (1 1 0)      //ponto 6
    (0 1 0)      //ponto 7
    
    (0 0 0.1)    //ponto 8
    (1 0 0.1)    //ponto 9
    (2 0 0.1)    //ponto 10
    (3 0 0.1)    //ponto 11
    (3 1 0.1)    //ponto 12
    (2 1 0.1)    //ponto 13
    (1 1 0.1)    //ponto 14
    (0 1 0.1)    //ponto 15
);

blocks
(
    hex (0 1 6 7 8 9 14 15) (50 54 1) simpleGrading (0.1416629781915 10 1)
    hex (1 2 5 6 9 10 13 14) (152 54 1) simpleGrading (1 10 1)
    hex (2 3 4 5 10 11 12 13) (50 54 1) simpleGrading (7.0590073198109 10 1)
);

edges
(
    arc 1 2 (1.5 0.1 0)
    arc 9 10 (1.5 0.1 0.1)
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 8 15 7)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (3 11 12 4)
        );
    }
    lowerWall
    {
        type patch;
        faces
        (
            (0 1 9 8)
            (1 2 10 9)
            (2 3 11 10)
        );
    }
    upperWall
    {
        type patch;
        faces
        (
            (7 6 14 15)
            (6 5 13 14)
            (5 4 12 13)
        );
    }
    front
    {
        type            empty;
        //neighbourPatch  back;
        faces
        (
            (8 9 14 15)
            (9 10 13 14)
            (10 11 12 13)
        );
    }
    back
    {
        type            empty;
        //neighbourPatch  front;
        faces
        (
            (1 0 7 6)
            (2 1 6 5)
            (3 2 5 4)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
